STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_MultipleConnections_Central/STM32_BLE/App/app_ble.c
    }
    else
    {
      APP_DBG_MSG("==>> GAP Create connection Failed , result: 0x%02X\n", result);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }
  else
  {
    APP_DBG_MSG("--Connect_Request() Device Server Not Found\n");
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
  }
  
  APP_DBG_MSG("--Connect_Request() end \n");
  return;
}



/**
* @brief  Prints the list of bonded devices.
* 
* This function retrieves and prints the list of bonded devices. It iterates through all bonded devices
* and prints their address type and address. If no bonded devices are found, it prints a message indicating
* that there are no bonded devices.
* 
* @retval None
*/
void Print_Bonded_Devices(void)
{
  Bonded_Device_Entry_t bonded_device;
  uint8_t num_returned_devices;
  uint8_t num_bonded_devices = 0;
  
  APP_DBG_MSG("Bonded devices:\n");
  
  for(int i = 0;; i++) {  
    aci_gap_get_bonded_devices(i, 1, &num_returned_devices, &bonded_device);
    
    if(num_returned_devices){
      APP_DBG_MSG("Type %d, @:%02X:%02X:%02X:%02X:%02X:%02X\n", bonded_device.Address_Type, bonded_device.Address[5], bonded_device.Address[4], bonded_device.Address[3], bonded_device.Address[2], bonded_device.Address[1], bonded_device.Address[0]);
    }
    else {
      break;
    }    
    num_bonded_devices += num_returned_devices;    
  }
  
  if(num_bonded_devices == 0){
    
    APP_DBG_MSG("No bonded devices.\n");
  }
}

/**
* @brief  Retrieves the number of bonded devices.
* 
* This function iterates through all bonded devices and counts the total number of bonded devices.
* 
* @retval uint8_t  The total number of bonded devices.
*/
uint8_t Get_Num_Bonded_Devices(void)
{
  Bonded_Device_Entry_t bonded_device;
  uint8_t num_returned_devices;
  uint8_t num_bonded_devices = 0;
  
  for(int i = 0;; i++) {  
    aci_gap_get_bonded_devices(i, 1, &num_returned_devices, &bonded_device);
    
    if(num_returned_devices == 0){
      break;
    }
    num_bonded_devices += num_returned_devices;    
  }
  
  return num_bonded_devices;
}


static void Start_Auto_Connection(void)
{  
  if(Get_Num_Bonded_Devices() == 0)
  {
    APP_DBG_MSG("No bonded device found - No Auto Connection started.\n");
    return;
  }

uint32_t status, paramA = SCAN_INT_MS(500), paramB = SCAN_WIN_MS(250);
  
  if (bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
  {
    status = aci_gap_configure_filter_accept_and_resolving_list(0x01);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_gap_configure_filter_accept_and_resolving_list command, result: 0x%02X\n", status);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_gap_configure_filter_accept_and_resolving_list command\n");
    }
  }
  
  status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 0x00, LE_1M_PHY_BIT, HCI_SCAN_TYPE_ACTIVE, paramA, paramB);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_scan_configuration - Success\n");
  }
  
  status = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                CONN_INT_MS(50u), 
                                                CONN_INT_MS(100u),
                                                0u,
                                                CONN_SUP_TIMEOUT_MS(5000u),
                                                CONN_CE_LENGTH_MS(10u), 
                                                CONN_CE_LENGTH_MS(10u));
  
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success , result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed , result: 0x%02X\n", status);
  }  
  
  /* Start the auto connection establishment procedure */
  status = aci_gap_start_procedure(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC, LE_1M_PHY_BIT, 0, 0);
  
  if (status != BLE_STATUS_SUCCESS)
  {
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    APP_DBG_MSG("==>> aci_gap_start_procedure GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - fail, result: 0x%02X\n", status);
  }
  else
  {
    bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING_AUTO_CONNECTION;
    APP_DBG_MSG("==>> aci_gap_start_procedure GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - Success\n");
  }
  
  if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    APP_DBG_MSG("==>> Start_Auto_Connection - Loop restart\n");
    Start_Auto_Connection();
  }
  
  return;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  APP_DBG_MSG("  In Central Role, the normal push button is not assigned to any action.\n");
  return;
}

void APPE_Button2Action(void)
{
  APP_DBG_MSG("  In Central Role, the normal push button is not assigned to any action.\n");
  return;
}

void APPE_Button3Action(void)
{
  APP_DBG_MSG("  In Central Role, the normal push button is not assigned to any action.\n");
  return;
}


void APPE_Button1LongPressAction(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING_AUTO_CONNECTION)
  {
    APP_DBG_MSG("APP_BLE_LP_CONNECTING_AUTO_CONNECTION is running\n");
    
    uint8_t status = aci_gap_terminate_proc(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("aci_gap_terminate_gap_proc - GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - fail, result: 0x%02X\n",status);
    }
    else
    {
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
      APP_DBG_MSG("==>> aci_gap_terminate_gap_proc - GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - Success\n");
    }
  }
  
  /* Check if the device is not connected as a BLE client */
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {  
    APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
  }
  
  return;
}


void APPE_Button2LongPressAction(void)
{
  /* Clear the security database if not connected as a BLE client */
  tBleStatus ret = aci_gap_clear_security_db();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
  }

  return;
}



void APPE_Button3LongPressAction(void)
{
    /* Check if the device is connected as a BLE client */
    if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT)
    {
      uint32_t status = aci_gap_terminate(bleAppContext.BleApplicationContext_legacy.connectionHandle, BLE_ERROR_TERMINATED_REMOTE_USER);
      
      /* Check if the termination command was successful */
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gap_terminate failure: reason=0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> aci_gap_terminate : Success\n");
        
        /* Wait for the HCI_DISCONNECTION_COMPLETE_EVT_CODE event */
        gap_cmd_resp_wait();
        APP_DBG_MSG("==>> aci_gap_terminate HCI_DISCONNECTION_COMPLETE_EVT_CODE event : Success\n");
      }
    }
  
    return;
}
  

#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
